Table of Contents
 Class ParameterBool
Namespace
IdeaRS.OpenModel.CrossSection
Assembly
IdeaRS.OpenModel.dll
Boolean parameter of cross-section
public class ParameterBool : Parameter
Inheritance
object
OpenObject
Parameter
ParameterBool
Inherited Members
 Parameter.Name
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Value
Value
public bool Value { get; set; }
Property Value
bool
 Edit this page